Revit 2027 API
ParameterTypeId.AnalyticalModelPhysicalType Property
 "Family Type": the Family Type of the physical element associated with the Analytical Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelPhysicalType { get; }
Public Shared ReadOnly Property AnalyticalModelPhysicalType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelPhysicalType {
	ForgeTypeId^ get ();
}
static member AnalyticalModelPhysicalType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace